Revit 2024 API
SpecTypeId.DuctInsulationThickness Property
 Duct Insulation Thickness, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DuctInsulationThickness { get; }
Visual Basic
Public Shared ReadOnly Property DuctInsulationThickness As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DuctInsulationThickness {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace